OpenFOAMcases/2DFDCDNS/constant/cellTable
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    note        "persistent data for thirdParty mesh <-> OpenFOAM translation";
    class       IOMap<dictionary>;
    location    "constant";
    object      cellTable;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


1
(
2 
{
    Label           cellTable_2;
    MaterialType    fluid;
}

)