OpenFOAMcases/2DFDCDNS/system/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

momentumSource
{
    type            vectorSemiImplicitSource;
    active          true;

    vectorSemiImplicitSourceCoeffs
    {
        selectionMode   all; // all, cellSet, cellZone, points
        volumeMode      specific; // absolute;
        injectionRateSuSp
        {
            U     ((1.0 0 0) 0);
        }
    }
}


// ************************************************************************* //
