OpenFOAMcases/2DFDCDNS/system/fvOptions.bk
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

momentumSource
{
    type            meanVelocityForce;

    //selectionMode   cellZone;
	//cellZone        inletCellZone;

	selectionMode   all;

    fields          (U);
    Ubar            (15.67 0 0);//need divied 1.3869, e.g. 20 = 14.4203 * 1.3869
}


// ************************************************************************* //
